{
    "title": "Ulysses S. Grant",
    "description": "was an American military officer and politician who served as the 18th president of the United States from 1869 to 1877. As commanding general, he led the Union Army to victory in the American Civil War in 1865 and thereafter briefly served as U.S. secretary of war. Later, as president, Grant was an effective civil rights executive who signed the bill that created the Justice Department and worked with Radical Republicans to protect African Americans during Reconstruction. Born and raised in Ohio, Grant attended West Point and graduated with the class of 1843, going on to serve with distinction in the Mexican–American War. He resigned from the army in 1854, returning to civilian life impoverished. In 1861, shortly after the American Civil War began, Grant joined the Union Army and quickly rose to prominence after winning early Union victories in the western theater. In 1863, he led the Vicksburg campaign, gaining control of the Mississippi River, dealing a serious strategic blow to the Confederacy. President Abraham Lincoln promoted him to lieutenant general after his victory at Chattanooga. For thirteen months, Grant fought Robert E. Lee during the high-casualty Overland Campaign which ended with capture of Lee's army at Appomattox, where he formally surrendered to Grant. In 1866, President Andrew Johnson promoted Grant to General of the Army. Later, Grant openly broke with Johnson over Reconstruction policies. A war hero, drawn in by his sense of duty, Grant was unanimously nominated by the Republican Party and then elected president in 1868. As president, Grant stabilized the post-war national economy, supported congressional Reconstruction and the ratification of the Fifteenth Amendment, and prosecuted the Ku Klux Klan. Under Grant, the Union was completely restored. He appointed African Americans and Jewish Americans to prominent federal offices. In 1871, he created the first Civil Service Commission, advancing the civil service more than any prior president. The Liberal Republicans and Democrats united behind Grant's opponent in the 1872 presidential election, but Grant was handily reelected. His response to the Panic of 1873 was ineffective in halting the Long Depression, which contributed to the Democrats winning the House majority in 1874. Grant's Native American policy was to assimilate Indians into Anglo-American culture. His foreign policy was mostly peaceful: the Alabama Claims against Great Britain were skillfully resolved without war, but the Senate rejected his attempted annexation of Santo Domingo. Although the Grant administration was often remembered primarily for a number of scandals, modern scholarship has better appreciated Grant's appointment of reformers and prosecutions. In the heavily disputed 1876 presidential election, Grant facilitated the approval by Congress of a peaceful compromise.   Upon leaving the presidency, Grant undertook a world tour, meeting a number of prominent figures, and becoming the first president to circumnavigate the world. In 1880, he was unsuccessful in obtaining the Republican presidential nomination for a third term. In the final year of his life, facing severe financial reversals and dying of throat cancer, Grant wrote his memoirs, which were posthumously published and became a major critical and financial success. At the time of his death, he was memorialized as a symbol of national unity. Due to the Lost Cause myth spread by Confederate sympathizers around the turn of the 20th century, historical assessments and rankings of Grant and his presidency suffered considerably before they began recovering in the 21st century. Grant's critics take a negative view of his economic mismanagement, and the corruption within his administration while his admirers emphasize his peace policy with Native Americans, vigorous enforcement of civil and voting rights for African Americans, and securing North and South as a single nation within the Union.[4]"
}